/*-------------------------------------------------------------
Создайте переменные: name, age, city, phone, email, company; и получите через ф-цию
prompt() соответствующие значения: ваше имя, возраст, город проживания и т.д.
Выведите на экран фразу: «Меня зовут %Имя%. Мне %Возраст% лет. Я проживаю в
городе %Город% и работаю в компании %Компания%. Мои контактные данные:
%Телефон%, %Почта%.». 
*/ 
/*
let name = prompt('Ваше имя', ''),
    age = prompt('Ваш возраст', ''),
    city = prompt('Город проживания', ''),
    phone = prompt('Номер телефона', ''),
    email = prompt('Электронную почту', ''),
    company = prompt('Где вы работаете?', ''); 

alert('Меня зовут ' + name + '. '
      + 'Мне ' + age + ' лет. ' 
      + 'Я проживаю в городе ' + city + ' и работаю в компании ' + company + '. '
      + 'Мои контактные данные: ' + phone + ', ' + email + '.');
*/
/* -----------------------------------------------------------------------------
Определите по введенному возрасту (исп. значение из задания 1) год рождения.
Выведите на экран «%Имя% родился в %Год% году.».  */
/*
let currentYear = new Date(2023),
    yearOfBirth = currentYear - age;
alert(name + ' родился в ' + yearOfBirth + '.'); 
*/

/*-------------------------------------------------------------------------------
Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме
вторых трех цифр. Если это так - выведите 'да', в противном случае выведите 'нет'. */

/* ----------------------------------------------------------------------
Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'. 
Проверьте работу скрипта при a, равном 1, 0, -3. */
/*
let a = -3;
if (a > 0) {
  console.log();('Верно')
} else {
  console.log();('Неверно')
} 
*/
/* -----------------------------------------------------------------------
Создайте переменные a=10 и b=2. Выведите их сумму, разность, произведение,
частное, а также, если сумма этих чисел больше 1, то возведите полученную сумму в
квадрат. */




